      *This program shows control table window


     Hdftactgrp(*no) actgrp(*caller)
     FCONTROLTBLIF   E           K DISK
     FCONTROLL1 IF   E           K DISK    RENAME(CONTROLR: CONTR1)
     FCNTRLDSPF CF   E             WORKSTN sfile(CTLLISTR:sflrrn)
     F                                     infds(dinfds)
     Ddinfds           ds
     DKeyPressed             369    369A
     Dsflrrn           S              4S 0 INZ(0)
     DsflLastRrn       S              5S 0 INZ(0)
     DdscExists        S              1S 0 INZ(0)
     Derror            S              1S 0 INZ(0)
     DI                S              1S 0 INZ(0)
     DsValue           S                   like(DVALUE)

     C     kctlD         KLIST
     C                   KFLD                    KEYFIELD1
     C                   KFLD                    KEYFIELD2
     C     kctlD1        KLIST
     C                   KFLD                    KEYFIELD1
     C     *ENTRY        PLIST
     C                   PARM                    pKeyFld1         10
     C                   PARM                    pKeyFld2         10
     C                   PARM                    pValue           10

      /free
      //main code
        exsr listFun;
        pvalue = svalue;
        *inlr = *on;
        return       ;

        //refresh screen
        begsr refrshScr;
          *in = *off;


          sflrrn = 0;
          *IN82 = *ON; //SFLCLR
          WRITE CTLLISTC;
          *in82 = *OFF;

       Endsr;
       //load subfile for listing
       begsr loadSfl;
        keyfield1 = pkeyfld1;
        keyfield2 = pkeyfld2;
        title = 'Select ' + keyfield2;
        if keyfield2 <> *Blanks;
            setll kCTLD  controlR;
            reade kCTLD  controlR;
        else;
            setll kCTLD1 contr1  ;
            reade kCTLD1 contr1;
        endif;
        dow not %eof(CONTROLTBL) and sflrrn < 20  ;
                sflrrn += 1;
                dvalue = value;
                ddescriptn = descriptn;
                write CTLLISTR        ;
           if keyfield2 <> *Blanks;
             reade kCTLD  controlR;
           else;
             reade kCTLD1 contr1;
           endif;
        enddo;
        sflLastRrn = sflrrn;
        if sflrrn >= 1;
                *in81 = *on;//SFLDSP = *ON
                *in89 = *on;//SFLDSPCTL = *ON
        else;
                *in81 = *off; //SFLDSP = *OFF
                *in89 = *on; //SFLDSPCTL = *ON
        endif;

        if %eof(CONTROLTBL);
                *in88 = *on;  // SFLEND
        else;
                *in88 = *off;
        endif;

       endsr;

       //list functionality
       begsr listFun;
        DoW *IN03 = *OFF;
             error = 0;
             if error = 0;
                exsr refrshScr;//clear subfile
                exsr loadSfl; //load subfile
             endif;

                *in83 = *on;
                write WINDOW;
                EXFMT CTLLISTC ;

                if *in12 = *on;
                        leave;
                endif;
                for i = 1 to sflLastRrn;
                    readc CTLLISTR;
                    if %eof();
                        leave;
                    endif;
                    if dOpt = '1';
                       *in91 = *off;
                       sValue = dvalue;
                       leavesr;
                    else;
                       error = 1;
                       *in91 = *on;
                    endif;
                endfor;

        enddo;
       endsr;



       /end-free
