     Dupdate           C                   CONST('UPDATE')
     Dadd              C                   CONST('ADD')
     Ddelete           C                   CONST('DELETE')
     Ddisplay          C                   CONST('DISPLAY')
     Dlogin            C                   CONST('LOGIN')
     Dlist             C                   CONST('LIST')
     Dadmin            C                   CONST('ADMIN')
     Dair              C                   CONST('AIRLINE')
     Duser             C                   CONST('USER')
     Dmain             C                   CONST('MAINSYSCL')
