     Hdftactgrp(*no) actgrp(*caller)
     HBNDDIR('VAVAN1/MYBNDDIR')
     FLOGINLF   UF   E           K DISK    RENAME(LOGINR:LOGILR)
     FLOGINDSPF CF   E             WORKSTN infds(dinfds)
     D vactionrp       pr             1s 0
     D Action                        10A
     D CallingMod                    10A
     DvalidUsr         S              1s 0
     DvalidAns         S              1s 0
     Dvalid            S              1s 0
     Dmsgid            S             10A
     D/COPY QRPGLESRC,SYSCOPYMBR
     Ddinfds           DS
     DKeyPressed             369    369A
     DMSGSFLCL         PR                  EXTPGM('MSGSFLCL')
     DMSGID                           7A
     DMSGF                           10A   const
     DMSGOPT                          1A   const
     DPGMQ                           10A   const
     C     *ENTRY        PLIST
     C                   PARM                    CallingMod       10
     C                   PARM                    Action           10
     C                   PARM                    puserId           5
     C                   PARM                    pRole            10
     C     kUserD        KLIST
     C                   KFLD                    userId
     C                   KFLD                    userPass
      /free
        //main code
        //if user id is passed as parameter use it
        PGMQ = 'LOGINRP';
        if puserId <> *blanks;
               userId = puserId;
        endif;
        //validate if action and calling module passed from calling program
        valid = 0;
        valid = VACTIONRP(Action:CallingMod);
        if valid = 1;
            select;
                  when Action = update;
                       exsr chgPwdFun;
                  other;
                       exsr loginFun;
            endsl;
        endif;
        *inlr = *on;
        return;
        begsr refreshScr;
           *in = *off;
           Clear LOGINDR;
           Clear FORGOTR;
         //*in45 = *off;
           exsr  clrmsgsfl;
        endsr;
       //validate user and password
        begsr  validateUsr;
        if duserId <> *Blanks;
           userId = duserId;
        endif;
        if duserPass <> *Blanks;
           userPass = duserPass;
        endif;
        chain(N) kUserD LOGILR ;
        if %found;
           validUsr = 1;
        endif;
        endsr;
       //validate the security question's answer
        begsr   validA;
        validAns = 0;
        if dLogAnswr = userAnswr;
           validAns = 1;
        endif;
        endsr;
       //display footer of the screen
       begsr    dspHdrFtr;
        duserId = userId;
        sdate = %date();
        stime = %time();
        WRITE LOGHDR;
        WRITE LOGFOOTR;
       endsr;
       //display login screen
       begsr dspLogScr;
        exfmt LOGINDR;
       endsr;
       //display forgot password screen
       begsr    dspForScr;
                exfmt FORGOTR;
       endsr;
       begsr    dspchgScr;
                exfmt CHGPWDR;
       endsr;
       //Login functionality
       begsr    loginFun;
                exsr refreshScr;
                Dow *in03 = *off and validUsr <> 1;
                    *in91 = *on;
                    exsr dspHdrFtr; //write header and footer record
                    exsr dspLogScr; //write Login screen record
                    if *in05 = *on;
                        exsr refreshScr;
                    endif;
                    if *in07 = *on;
                         exsr ForgotFun;
                         leave;
                    endif;
                    exsr validateUsr;
                    if validUsr = 1;
                         puserId = userId;
                         pRole = userRole;
                    endif;
              enddo;

        endsr;
       //forgot password functionality
       begsr ForgotFun;
               exsr refreshScr;
               Dow *in03 = *off;
                   *in92 = *on;
                   *in93 = *on;
                   exsr dspHdrFtr;
                   write LOGERRCTL;
                   exsr dspForScr;
                   chain duserId LOGILR ;
                   if %found;
              //      duserId = userId;
                      duserQstn = userQstn;
                   endif;
                   if *in05 = *on;
                      exsr refreshScr;
                   endif;
                   if (*IN06 = *on or KeyPressed = X'F1')
                             and dLogAnswr <> *Blanks;
                      exsr  clrmsgsfl;
                      exsr validA;
                      if validAns = 1;
                           *in30 = *off;
                         if duserPass <> *blanks  and
                            dconPass  <> *blanks;
                           if duserPass = dconPass;
                               userPass = dconPass;
                               *in31 = *off;
                               *in32 = *off;
                               IF *IN06 = *ON;
                                   UPDATE LOGILR;
                                   leavesr;
                               ENDIF;
                           else;
                               *in31 = *on;
                               *in32 = *on;
                               MSGID = 'UAR0002';
                               EXSR showmsg;
                           endif;
                          endif;
                      else;
                           *in30 = *on;
                           MSGID = 'UAR0001';
                           EXSR showmsg;
                      endif;

                 endif;
                 *IN99 = *ON;
            enddo;
       endsr;
       //change password functionality
       begsr chgPwdFun;
          chain userId LOGILR ;
          if %found;
             exsr refreshScr;
             Dow *in03 = *off;
                   *in90 = *on;
                    exsr dspHdrFtr;
                   write LOGERRCTL;
                    exsr dspChgScr;
                    if *in05 = *on;
                       exsr refreshScr;
                    endif;
                    if (*IN06 = *on or KeyPressed = X'F1');
                       exsr  clrmsgsfl;
                       *in37 = *off;
                       *in38 = *off;
                       *in36 = *off;
                       if duserPass = userPass;
                           if  dNewPass = dconPass;
                               IF *IN06 = *ON;
                                 userPass = dconPass;
                                 UPDATE LOGILR;
                                 leavesr;
                               ENDIF;
                               *in37 = *off;
                               *in38 = *off;
                            else;
                                *in37 = *on;
                                *in38 = *on;
                                MSGID = 'UAR0002';
                                EXSR showmsg;
                            endif;
                       else;
                           *in36 = *on;
                           MSGID = 'UAR0003';
                           EXSR showmsg;
                       endif;
                    endif;
            enddo;
          endif;
        endsr;
       begsr showmsg;

               callp msgsflcl(MSGID:'AIRERRMSGF':'I':PGMQ);
        endsr;
       /end-free
       begsr clrmsgsfl;

               callp msgsflcl(MSGID:'AIRERRMSGF':'C':PGMQ);
        endsr;
       /end-free
